{
    "intersections": [
        {
            "smallerKey": "addFeature",
            "largerKey": "addFeature",
            "value": "There's an area in Table View where I can instruct the program to add a new feature to the project."
        },
        {
            "smallerKey": "addFeature",
            "largerKey": "edit",
            "value": "The intersection between a newly added feature and an existing feature, or two newly added features can be edited."
        },
        {
            "smallerKey": "addFeature",
            "largerKey": "export",
            "value": "- Newly added features are reflected in the model.\n- This is true even if no intersection has been edited since the addition of the new feature.\n- If a new feature is added while the export view is shown, the view is update immediately."
        },
        {
            "smallerKey": "addFeature",
            "largerKey": "focusMode",
            "value": "- If a new feature is added while in focus mode, the new feature can be reached while cycling through the features.\n- There is a button in the new feature add panel to add a feature and enter focus mode in one click."
        },
        {
            "smallerKey": "addFeature",
            "largerKey": "hideFeature",
            "value": "Newly added features can be hidden."
        },
        {
            "smallerKey": "addFeature",
            "largerKey": "showFeatures",
            "value": "The feature table immediately reflects the newly added feature."
        },
        {
            "smallerKey": "edit",
            "largerKey": "edit",
            "value": "If I type in a field other than the main diagonal, it'll appear in the transposition of the cell I typed into as well."
        },
        {
            "smallerKey": "edit",
            "largerKey": "export",
            "value": "- If I edit an intersection, it's represented in the exportable model.\n- If I edit an intersection while the export textbox is shown, the textbox updates immediately."
        },
        {
            "smallerKey": "edit",
            "largerKey": "focusMode",
            "value": "When editing an intersection in focus mode, we edit the intersection between the selected (fixed) feature and the currently showing feature."
        },
        {
            "smallerKey": "edit",
            "largerKey": "hideFeature",
            "value": "Intersections where at least one feature is hidden cannot be edited (obviously). However if a feature has been hidden and then shown, it can be edited again."
        },
        {
            "smallerKey": "edit",
            "largerKey": "import",
            "value": "When the text field state (of the export text) is changed, the intersections are reflected in the feature table (as long as the model is valid)."
        },
        {
            "smallerKey": "edit",
            "largerKey": "showFeatures",
            "value": "In Table View I can type in an intersection of two features."
        },
        {
            "smallerKey": "export",
            "largerKey": "export",
            "value": "There is a button that allows me to view a text representation of my project.\nThe button can be clicked and then a textbox appears with the text representation."
        },
        {
            "smallerKey": "export",
            "largerKey": "focusMode",
            "value": "Export works the same way as in table mode (the new state is immediately shown if the text representation if visible)."
        },
        {
            "smallerKey": "export",
            "largerKey": "hideFeature",
            "value": "Hidden features are exported as well."
        },
        {
            "smallerKey": "export",
            "largerKey": "import",
            "value": "Exporting and importing the model are symmetrical. I.e. I can get the project model to exactly the same state where I was if I export the project, reload the page, then import the model."
        },
        {
            "smallerKey": "focusMode",
            "largerKey": "focusMode",
            "value": "In Focus Mode there is no feature table, instead we can go through the other features one at a time.\n- There are buttons to move to the previous / next feature (cycling).\n- There is a button to return to table view"
        },
        {
            "smallerKey": "focusMode",
            "largerKey": "hideFeature",
            "value": "- Features that have been hidden in table view still show up in focus mode.\n- The hidden / shown status of a feature in table mode is preserved after returning to table mode."
        },
        {
            "smallerKey": "focusMode",
            "largerKey": "import",
            "value": "- When importing, if the import changes the currently focused intersection, that is shown immediately.\n- When importing, if the focused feature no longer exists, the view returns to table view.\n- When importing, if the intersection currently shown in the focus mode no longer exists, we go to the next feature that exists.\n- When importing, if the import text is invalid, an error message is shown (the same as in table view)"
        },
        {
            "smallerKey": "focusMode",
            "largerKey": "showFeatures",
            "value": "- Focus mode can be entered using a button on the feature header in the feature table."
        },
        {
            "smallerKey": "hideFeature",
            "largerKey": "hideFeature",
            "value": "Features can be hidden in Table View using a button next to each feature column / row header. Hidden features show up in the side bar with a button allowing them to be enabled."
        },
        {
            "smallerKey": "hideFeature",
            "largerKey": "import",
            "value": "Importing (changing the text in the export/import text field) preserves the shown / hidden state of features currently in the table (as long as the model is valid)."
        },
        {
            "smallerKey": "hideFeature",
            "largerKey": "showFeatures",
            "value": "Hidden features do not show up in Table View."
        },
        {
            "smallerKey": "import",
            "largerKey": "import",
            "value": "If I change the state of the text field showing the exported model I instruct the system to load the new representation."
        },
        {
            "smallerKey": "import",
            "largerKey": "showFeatures",
            "value": "When the text field state (of the export text) is changed, the features shown are reflected in the feature table (as long as the model is valid)."
        },
        {
            "smallerKey": "showFeatures",
            "largerKey": "showFeatures",
            "value": "There is Table Mode in which all feature intersections can be seen."
        }
    ],
    "features": [
        {
            "featureId": "showFeatures",
            "displayName": "Shows Features",
            "description": "Shows features as a Table"
        },
        {
            "featureId": "edit",
            "displayName": "Edit Intersection",
            "description": "Type Features into the Cells of the Table"
        },
        {
            "featureId": "export",
            "displayName": "Export",
            "description": "Export the Current Model into JSON"
        },
        {
            "featureId": "import",
            "displayName": "Import",
            "description": "Import the Model from JSON"
        },
        {
            "featureId": "addFeature",
            "displayName": "Add Feature",
            "description": "A New Feature can be Added With Description"
        },
        {
            "featureId": "hideFeature",
            "displayName": "Hide Feature",
            "description": "Remove a Feature from the Feature Table, and Provide Button to Show Again"
        },
        {
            "featureId": "focusMode",
            "displayName": "Focus Mode",
            "description": "Focus Mode lets the user focus on the interactions between a single selected feature and all the other features in the project.\nThis is especially useful when adding new features."
        }
    ],
    "featureVisibilities": [
        {
            "featureId": "addFeature",
            "visible": true
        },
        {
            "featureId": "edit",
            "visible": true
        },
        {
            "featureId": "export",
            "visible": true
        },
        {
            "featureId": "focusMode",
            "visible": true
        },
        {
            "featureId": "hideFeature",
            "visible": true
        },
        {
            "featureId": "import",
            "visible": true
        },
        {
            "featureId": "showFeatures",
            "visible": true
        }
    ]
}